#### Terraform Plan ('src/domains/elt/prod/westeurope') 📖
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.function_apps.azurerm_monitor_diagnostic_setting.queue_diagnostic_setting will be created
  + resource "azurerm_monitor_diagnostic_setting" "queue_diagnostic_setting" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.OperationalInsights/workspaces/io-p-law-common"
      + name                           = "io-p-fnelt-internal-st-queue-ds-01"
      + target_resource_id             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-elt-rg/providers/Microsoft.Storage/storageAccounts/iopfneltsdt/queueServices/default"

      + enabled_log {
          + category = "StorageWrite"
        }

      + metric {
          + category = "Capacity"
          + enabled  = false
        }
      + metric {
          + category = "Transaction"
          + enabled  = false
        }
    }

  # module.function_apps.azurerm_monitor_scheduled_query_rules_alert_v2.service_preferences_failure_alert_rule will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert_v2" "service_preferences_failure_alert_rule" {
      + auto_mitigation_enabled                = false
      + created_with_api_version               = (known after apply)
      + description                            = "Permanent failures processing Service Preferences export to PDND. REQUIRED MANUAL ACTION"
      + enabled                                = true
      + evaluation_frequency                   = "PT15M"
      + id                                     = (known after apply)
      + is_a_legacy_log_analytics_rule         = (known after apply)
      + is_workspace_alerts_storage_configured = (known after apply)
      + location                               = "westeurope"
      + name                                   = "[CITIZEN-AUTH | iopfneltsdt] Failures on pdnd-io-cosmosdb-service-preferences-failure-poison"
      + resource_group_name                    = "io-p-elt-rg"
      + scopes                                 = [
          + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-elt-rg/providers/Microsoft.Storage/storageAccounts/iopfneltsdt",
        ]
      + severity                               = 1
      + tags                                   = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Platform"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/domains/elt/prod"
        }
      + window_duration                        = "PT15M"
      + workspace_alerts_storage_enabled       = false

      + action {
          + action_groups = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/actionGroups/iopquarantineerror",
            ]
        }

      + criteria {
          + operator                = "GreaterThan"
          + query                   = <<-EOT
                StorageQueueLogs
                  | where OperationName contains "PutMessage"
                  | where Uri contains "pdnd-io-cosmosdb-service-preferences-failure"
                  | distinct Uri
                  | project QueueName = split(Uri, "/")[3]
            EOT
          + threshold               = 0
          + time_aggregation_method = "Count"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
